tap "controlplaneio-fluxcd/tap"
tap "domt4/autoupdate"
tap "fluxcd/tap"
tap "gimlet-io/capacitor"
tap "hashicorp/tap"
tap "kdash-rs/kdash"
tap "netbirdio/tap"
tap "robusta-dev/krr"
tap "shodan-public/shodan", "https://gitlab.com/shodan-public/homebrew-shodan"
tap "sinelaw/fresh"
tap "vectordotdev/brew"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Official Amazon AWS command-line interface
brew "awscli"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# High performance csv viewer for cli
brew "csview"
# Command-line DNS Client for Humans
brew "doggo"
# .NET Core
brew "dotnet@8"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Diff tool for YAML files, and sometimes JSON
brew "dyff"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Language server for Helm
brew "helm-ls"
# Kubernetes package manager
brew "helm@3", link: true
# Fast and multi-purpose HTTP toolkit
brew "httpx"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# CLI for interacting with Grafana Mimir
brew "mimirtool"
# Run a Kubernetes cluster locally
brew "minikube"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Text-based UI library
brew "ncurses"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Modern replacement for ps written in Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Modern Day Portscanner
brew "rustscan"
# Compressed read-only file system for Linux
brew "squashfs"
# Non-interactive SSH password auth
brew "sshpass"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Distributed SQL query engine for big data
brew "trino"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Language Server for Yaml Files
brew "yaml-language-server"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Flux MCP Server
brew "controlplaneio-fluxcd/tap/flux-operator-mcp"
# Flux CLI
brew "fluxcd/tap/flux"
# Vault
brew "hashicorp/tap/vault"
# Kubernetes Resource Recommender by Robusta
brew "robusta-dev/krr/krr"
# IPs Analyze Tool
brew "shodan-public/shodan/nrich"
# A High-Performance Log, Metrics, and Events Router
brew "vectordotdev/brew/vector"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# Kubernetes desktop client
cask "aptakube"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Control USB Cameras from an app
cask "cameracontroller"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Write, edit, and chat about your code with AI
cask "cursor"
# Developer platform
cask "dotnet-sdk"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# iPhone management application
cask "imazing"
# Media system
cask "jellyfin"
# File archiver
cask "keka"
# Kubernetes IDE
cask "lens"
# Support for Logitech G gear
cask "logitech-g-hub"
# Extensible two-pane file manager
cask "marta"
# Netbird UI Client
cask "netbird-ui"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Android file transfer
cask "openmtp"
# Replacement for Docker Desktop
cask "orbstack"
# Security checklist app
cask "pareto-security"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Manage Samsung internal and portable SSDs, memory cards, and USB flash drives
cask "samsung-magician"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Interior design application
cask "sweet-home3d"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Connect to Windows
cask "windows-app"
# Multiplayer code editor
cask "zed@preview"
# Video communication and virtual meeting platform
cask "zoom"
mas "Actions", id: 1586435171
mas "FireStream", id: 1005325119
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
go "sigs.k8s.io/cloud-provider-kind"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
