tap "coder/coder"
tap "controlplaneio-fluxcd/tap"
tap "domt4/autoupdate"
tap "fluxcd/tap"
tap "gimlet-io/capacitor"
tap "hashicorp/tap"
tap "kdash-rs/kdash"
tap "netbirdio/tap"
tap "richyparr/tokemon"
tap "robusta-dev/krr"
tap "rtk-ai/tap"
tap "shodan-public/shodan", "https://gitlab.com/shodan-public/homebrew-shodan"
tap "sinelaw/fresh"
tap "steipete/tap"
tap "vectordotdev/brew"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Official Amazon AWS command-line interface
brew "awscli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Testing and linting Helm charts
brew "chart-testing"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for interacting with remote images and registries
brew "crane"
# High performance csv viewer for cli
brew "csview"
# Command-line DNS Client for Humans
brew "doggo"
# .NET Core
brew "dotnet@8"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Diff tool for YAML files, and sometimes JSON
brew "dyff"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Convert HCL2 to JSON
brew "hcl2json"
# Language server for Helm
brew "helm-ls"
# Kubernetes package manager
brew "helm@3", link: true
# Fast and multi-purpose HTTP toolkit
brew "httpx"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# CLI for interacting with Grafana Mimir
brew "mimirtool"
# Run a Kubernetes cluster locally
brew "minikube"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Text-based UI library
brew "ncurses"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Package manager for Microsoft development platform including .NET
brew "nuget"
# Development kit for the Java programming language
brew "openjdk@17"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Modern replacement for ps written in Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Modern Day Portscanner
brew "rustscan"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Editor of encrypted files
brew "sops"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# Compressed read-only file system for Linux
brew "squashfs"
# Non-interactive SSH password auth
brew "sshpass"
# User interface to the TELNET protocol
brew "telnet"
# Instant terminal sharing
brew "tmate"
# Program that allows you to count code, quickly
brew "tokei"
# Distributed SQL query engine for big data
brew "trino"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Language Server for Yaml Files
brew "yaml-language-server"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Provisions remote development environments via Terraform
brew "coder/coder/coder"
# Flux Operator CLI
brew "controlplaneio-fluxcd/tap/flux-operator"
# Flux MCP Server
brew "controlplaneio-fluxcd/tap/flux-operator-mcp"
# Flux CLI
brew "fluxcd/tap/flux"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Kubernetes Resource Recommender by Robusta
brew "robusta-dev/krr/krr"
# Permanent memory for AI agents — MCP server with hybrid search
brew "rtk-ai/tap/icm"
# IPs Analyze Tool
brew "shodan-public/shodan/nrich"
# A High-Performance Log, Metrics, and Events Router
brew "vectordotdev/brew/vector"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# Kubernetes desktop client
cask "aptakube"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Control USB Cameras from an app
cask "cameracontroller"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Developer platform
cask "dotnet-sdk"
# Status monitoring
cask "eul"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source video transcoder
cask "handbrake-app"
# iPhone management application
cask "imazing"
# Media system
cask "jellyfin"
# File archiver
cask "keka"
# Kubernetes IDE
cask "lens"
# .NET LINQ database query tool and code scratchpad
cask "linqpad"
# Clipboard manager
cask "maccy"
# Extensible two-pane file manager
cask "marta"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Native app email client for Gmail
cask "mimestream"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Document editor
cask "onlyoffice"
# Android file transfer
cask "openmtp"
# Replacement for Docker Desktop
cask "orbstack"
# Security checklist app
cask "pareto-security"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Manage Samsung internal and portable SSDs, memory cards, and USB flash drives
cask "samsung-magician"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Interior design application
cask "sweet-home3d"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Connect to Windows
cask "windows-app"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Actions", id: 1586435171
mas "FireStream", id: 1005325119
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Screens 5", id: 1663047912
vscode "github.copilot-chat"
go "sigs.k8s.io/cloud-provider-kind"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
uv "checkov"
uv "flux-local"
npm "@notionhq/notion-mcp-server"
npm "context-mode"
