tap "domt4/autoupdate"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
brew "ansible"
brew "azure-cli"
brew "bash-completion"
brew "ddrescue"
brew "gcc"
brew "gh"
brew "git"
brew "git-open"
brew "glances"
brew "go"
brew "graphviz"
brew "haproxy"
brew "helm"
brew "helmfile"
brew "htop"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kustomize"
brew "mas"
brew "midnight-commander"
brew "minikube"
brew "mtr"
brew "ncdu"
brew "nmap"
brew "node@10", link: true
brew "packer"
brew "shellcheck"
brew "siege"
brew "ssh-copy-id", link: true
brew "terminal-notifier"
brew "terraform"
brew "wget"
brew "instrumenta/instrumenta/kubeval"
cask "1password"
cask "adobe-acrobat-reader"
cask "aerial"
cask "azure-data-studio"
cask "caffeine"
cask "cloudapp"
cask "docker"
cask "dotnet-sdk"
cask "google-chrome"
cask "google-drive-file-stream"
cask "lens"
cask "multipass"
cask "notion"
cask "open-in-code"
cask "powershell"
cask "punto-switcher"
cask "qbittorrent"
cask "royal-tsx"
cask "scroll-reverser"
cask "setapp"
cask "slate"
cask "steam"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "Healthier", id: 534953542
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Slack", id: 803453959
mas "Sweet Home 3D", id: 669289700
mas "Telegram", id: 747648890
mas "WiFi Explorer", id: 494803304
